## Ejercicio 1

Crea una función llamada ejercicio1, que recibe la ruta donde se encuentra un dataset y devuelve una DataFrame con los datos que hay en el dataset. Para comprobar esta función utiliza el dataset `titanic.csv` que se incluye en esta actividad.

In [12]:
def ejercicio1(path:str):
    import pandas as pd
    df = pd.read_csv(path, sep=',')
    return df

# df = ejercicio1('titanic.csv')
# df.dtypes

## Ejercicio 2

Crea otra función llamada ejercicio2. Esta función recibe un único argumento que es un dataframe. En concreto debe recibir el dataframe que se ha obtenido de leer el dataset `titanic.csv`. Esta función devolverá otro dataset que incluya únicamente a los pasajeros menores de 35 años y que viajaban en 3ª clase.

In [61]:
def ejercicio2(df):
    df = df.copy()
    df = df[(df['Age'] < 35.0) & (df['Pclass'] == 3)]
    return df
ejercicio2(ejercicio1('titanic.csv'))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
...,...,...,...,...,...,...,...,...,...,...,...,...
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Ejercicio 3

Crea una función llamada ejercicio3, que recibiendo como argumento el dataframe de salida del ejercicio 2, calcule el porcentaje de pasajeros menores de 35 años de 3ª clase que sobrevivieron.

In [64]:
def ejercicio3(df):
    df = df.copy()
    df = ejercicio2(df)
    surv_df = df[['PassengerId','Survived']].groupby(by='Survived').count()
    surv_df['porcentage'] = surv_df['PassengerId'] / surv_df['PassengerId'].sum()*100
    survived = surv_df['porcentage'][surv_df.index == 1].values[0]
    return survived
# ejercicio3(ejercicio1('titanic.csv'))

27.27272727272727

## Ejercicio 4

Implementa una función llamada ejercicio4 que recibiendo el dataframe con los datos del Titanic, devuelva en una tupla el porcentaje de hombres y mujeres que viajaban en el Titanic, redondeados al segundo decimal.

In [59]:
def ejercicio4(df):
    df = df[['PassengerId', 'Sex']].copy()
    sex = df.groupby(by='Sex').count()
    sex['prc'] = sex['PassengerId'] / sex['PassengerId'].sum()*100
    male = sex['prc'][sex.index =='male'].values[0]
    female = sex['prc'][sex.index =='female'].values[0]
    # male = round(male,2)
    # female = round(female, 2)
    return male, female

# ejercicio4(ejercicio1('titanic.csv'))

(64.75869809203144, 35.24130190796858)

## Ejercicio 5


Implementa una función llamada ejercicio5 que recibiendo el dataframe con los datos del Titanic, devuelva en una lista el número de pasajeros que viajaban en 1ª, 2ª y 3ª clase.

In [55]:
def ejercicio5(df):
    df = df[['PassengerId', 'Pclass']].copy()
    p_class = df.groupby(by='Pclass').count()
    first_class = p_class['PassengerId'][p_class.index ==1].values[0]
    second_class = p_class['PassengerId'][p_class.index ==2].values[0]
    third_class = p_class['PassengerId'][p_class.index ==3].values[0]
    lista_class = [first_class, second_class, third_class]
    return lista_class

# ejercicio5(ejercicio1('titanic.csv'))

[216, 184, 491]